README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Description</a>
<ul>
<li><a href="#sec-1-1">1.1. Installation</a></li>
<li><a href="#sec-1-2">1.2. Usage</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Development</a>
<ul>
<li><a href="#sec-2-1">2.1. Authors</a></li>
<li><a href="#sec-2-2">2.2. TODOs</a></li>
</ul>
</li>
</ul>
</div>
</div>

---

# Description<a id="sec-1" name="sec-1"></a>

This `R` package provides functionality to plot data in genomic context. These include functions to plot transcripts, genes or other features together with data (e.g. microarray probe data or sequencing data) on genomic coordinates.

## Installation<a id="sec-1-1" name="sec-1-1"></a>

-   Check out the source code from github:

    git clone https://github.com/jotsetung/GenomePlotR.git
-   Install the package.

    R CMD INSTALL GenomePlotR

## Usage<a id="sec-1-2" name="sec-1-2"></a>

Refer to the help pages and function descriptions from within `R`, e.g. start the help system and open it in your browser (type `help.start()` in your `R` session) and click on `Packages` and the link for the `GenomePlotR` package.

# Development<a id="sec-2" name="sec-2"></a>

Please add new functions or improve existing ones. New functions should be documented (`Rd` format) and listed in this document (`README.org`). This file should then be exported as a markdown (`md`) file (best performed in Emacs org-mode `c-c c-e`).

## Authors<a id="sec-2-1" name="sec-2-1"></a>

-   Johannes Rainer

(please add your name to this (`README.org`) file if you edit the code or add new functionality).

## TODOs<a id="sec-2-2" name="sec-2-2"></a>